RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
/**
 *******************************************************************************
 * @file  hc32_ll_nfc.c
 * @brief This file provides firmware functions to manage the EXMC NFC
 *        (External Memory Controller: NAND Flash Controller) driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
   2023-09-30       CDT             Typo: featrue -> feature; regsiter, Regster -> register
                                    Modify macro: EXMC_NFC_4BIT_ECCS -> EXMC_NFC_4BIT_ECC
                                    Change function attributes from local to global: EXMC_NFC_Read/EXMC_NFC_Write
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <string.h>
#include "hc32_ll_nfc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_EXMC EXMC
 * @brief External Memory Controller Driver Library
 * @{
 */

/**
 * @defgroup LL_NFC NFC
 * @brief NAND Flash Controller Driver Library
 * @{
 */

#if (LL_NFC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EXMC_NFC_Local_Macros EXMC_NFC Local Macros
 * @{
 */

/**
 * @defgroup EXMC_NFC_Check_Parameters_Validity EXMC_NFC Check Parameters Validity
 * @{
 */

#define IS_EXMC_NFC_BANK(x)                 ((x) <= EXMC_NFC_BANK7)

#define IS_EXMC_NFC_MEMORY_WIDTH(x)                                            \
(   ((x) == EXMC_NFC_MEMORY_WIDTH_8BIT)     ||                                 \
    ((x) == EXMC_NFC_MEMORY_WIDTH_16BIT))

#define IS_EXMC_NFC_BANK_CAPACITY(x)                                           \
(   ((x) == EXMC_NFC_BANK_CAPACITY_1GBIT)   ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_2GBIT)   ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_4GBIT)   ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_8GBIT)   ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_16GBIT)  ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_32GBIT)  ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_64GBIT)  ||                                 \
    ((x) == EXMC_NFC_BANK_CAPACITY_512MBIT))

#define IS_EXMC_NFC_PAGE_SIZE(x)                                               \
(   ((x) == EXMC_NFC_PAGE_SIZE_2KBYTE)      ||                                 \
    ((x) == EXMC_NFC_PAGE_SIZE_4KBYTE)      ||                                 \
    ((x) == EXMC_NFC_PAGE_SIZE_8KBYTE))

#define IS_EXMC_NFC_BANK_NUM(x)                                                \
(   ((x) == EXMC_NFC_1BANK)                 ||                                 \
    ((x) == EXMC_NFC_2BANKS)                ||                                 \
    ((x) == EXMC_NFC_4BANKS)                ||                                 \
    ((x) == EXMC_NFC_8BANKS))

#define IS_EXMC_NFC_WR_PROTECT(x)                                              \
(   ((x) == EXMC_NFC_WR_PROTECT_ENABLE)     ||                                 \
    ((x) == EXMC_NFC_WR_PROTECT_DISABLE))

#define IS_EXMC_NFC_ECC_MD(x)                                                  \
(   ((x) == EXMC_NFC_1BIT_ECC)              ||                                 \
    ((x) == EXMC_NFC_4BIT_ECC))

#define IS_EXMC_NFC_ROW_ADDR_CYCLES(x)                                         \
(   ((x) == EXMC_NFC_2_ROW_ADDR_CYCLE)      ||                                 \
    ((x) == EXMC_NFC_3_ROW_ADDR_CYCLE))

#define IS_EXMC_NFC_SECTION(x)              ((x) <= EXMC_NFC_ECC_SECTION15)

#define IS_EXMC_NFC_INT(x)                                                     \
(   ((x) != 0UL)                            &&                                 \
    (((x) | EXMC_NFC_INT_MASK) == EXMC_NFC_INT_MASK))

#define IS_EXMC_NFC_FLAG(x)                                                    \
(   ((x) != 0UL)                            &&                                 \
    (((x) | EXMC_NFC_FLAG_MASK) == EXMC_NFC_FLAG_MASK))

#define IS_EXMC_NFC_TIMING_TS(x)            ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWP(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRP(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TH(x)            ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWH(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRH(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRR(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWB(x)           ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TCCS(x)          ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWTR(x)          ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRTW(x)          ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TADL(x)          ((x) <= 0xFFUL)

#define IS_EXMC_NFC_COLUMN(x)               ((x) <= NFC_COLUMN_MAX)

#define IS_EXMC_NFC_PAGE(page, capacity_index)  ((page) <= NFC_PAGE_MAX((capacity_index)))

#define IS_PARAM_ALIGN_WORD(x)              (IS_ADDR_ALIGN_WORD((x)))
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Interrupt_Mask EXMC_NFC Interrupt Mask
 * @{
 */
#define EXMC_NFC_INT_MASK                                                      \
(   EXMC_NFC_INT_RB_BANK0                   |                                  \
    EXMC_NFC_INT_RB_BANK1                   |                                  \
    EXMC_NFC_INT_RB_BANK2                   |                                  \
    EXMC_NFC_INT_RB_BANK3                   |                                  \
    EXMC_NFC_INT_RB_BANK4                   |                                  \
    EXMC_NFC_INT_RB_BANK5                   |                                  \
    EXMC_NFC_INT_RB_BANK6                   |                                  \
    EXMC_NFC_INT_RB_BANK7                   |                                  \
    EXMC_NFC_INT_ECC_ERROR                  |                                  \
    EXMC_NFC_INT_ECC_CALC_COMPLETION        |                                  \
    EXMC_NFC_INT_ECC_CORRECTABLE_ERR        |                                  \
    EXMC_NFC_INT_ECC_UNCORRECTABLE_ERR)
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Flag_Mask EXMC_NFC Flag Mask
 * @{
 */
#define EXMC_NFC_FLAG_MASK                                                     \
(   EXMC_NFC_FLAG_RB_BANK0                  |                                  \
    EXMC_NFC_FLAG_RB_BANK1                  |                                  \
    EXMC_NFC_FLAG_RB_BANK2                  |                                  \
    EXMC_NFC_FLAG_RB_BANK3                  |                                  \
    EXMC_NFC_FLAG_RB_BANK4                  |                                  \
    EXMC_NFC_FLAG_RB_BANK5                  |                                  \
    EXMC_NFC_FLAG_RB_BANK6                  |                                  \
    EXMC_NFC_FLAG_RB_BANK7                  |                                  \
    EXMC_NFC_FLAG_ECC_ERR                   |                                  \
    EXMC_NFC_FLAG_ECC_CALCULATING           |                                  \
    EXMC_NFC_FLAG_ECC_CALC_COMPLETION       |                                  \
    EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR       |                                  \
    EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR)
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Memory_Capacity_Index EXMC_NFC Memory Capacity Index
 * @{
 */
#define NFC_CAPACITY_INDEX_512MBIT          (0UL)
#define NFC_CAPACITY_INDEX_1GBIT            (1UL)
#define NFC_CAPACITY_INDEX_2GBIT            (2UL)
#define NFC_CAPACITY_INDEX_4GBIT            (3UL)
#define NFC_CAPACITY_INDEX_8GBIT            (4UL)
#define NFC_CAPACITY_INDEX_16GBIT           (5UL)
#define NFC_CAPACITY_INDEX_32GBIT           (6UL)
#define NFC_CAPACITY_INDEX_64GBIT           (7UL)
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Command_Register_Value EXMC_NFC Command Register Value
 * @{
 */
/*!< Command value */
#define NFC_CMD_VALUE(arg, bank, cmd)       ((arg) | ((bank) << 8U) | (cmd))

