RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
/*!< Command: Read status */
#define NFC_ADDR_VALUE(bank, addr)          (0x40000000UL | ((bank) << 8U) | (addr))

/*!< Command: Read status */
#define CMD_RESET(bank)                     (NFC_CMD_VALUE(0UL, (bank), EXMC_NFC_CMD_RESET))

/*!< Command: Read status */
#define CMD_ASYNC_RESET(bank)               (NFC_CMD_VALUE(0x82000000UL, (bank), EXMC_NFC_CMD_ASYNCHRONOUS_RST))

/*!< Command: Read status */
#define CMD_RESET_LUN(bank)                 (NFC_CMD_VALUE(0x82000000UL, (bank), EXMC_NFC_CMD_RST_LUN))

/*!< Command: Read status */
#define CMD_READ_STATUS(bank)               (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_RD_STATUS))

/*!< Command: Read status */
#define CMD_READ_STATUS_ENHANCED(bank)      (NFC_CMD_VALUE(0x80000000UL, (bank), EXMC_NFC_CMD_RD_STATUS_ENHANCED))

/*!< Command: Read ID */
#define CMD_READ_ID(bank)                   (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_RD_ID))
#define CMD_READ_ID_ADDR(bank, addr)        (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Read unique ID */
#define CMD_READ_UNIQUEID(bank)             (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_RD_UNIQUE_ID))
#define CMD_READ_UNIQUEID_ADDR(bank)        (NFC_ADDR_VALUE((bank), 0UL))

/*!< Command: Erase block */
#define CMD_ERASE_BLOCK_1ST_CYCLE(bank)     (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_BLK_ERASE_1ST))
#define CMD_ERASE_BLOCK_2ND_CYCLE(bank)     (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_BLK_ERASE_2ND))

/*!< Command: Read parameter page */
#define CMD_READ_PARAMETER_PAGE(bank)       (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_RD_PARAMETER_PAGE))
#define CMD_READ_PARAMETER_PAGE_ADDR(bank)  (NFC_ADDR_VALUE((bank), 0UL))

/*!< Command: Set feature */
#define CMD_SET_FEATURE(bank)               (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_SET_FEATURES))
#define CMD_SET_FEATURE_ADDR(bank, addr)    (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Get feature */
#define CMD_GET_FEATURE(bank)               (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_GET_FEATURES))
#define CMD_GET_FEATURE_ADDR(bank, addr)    (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Address cycle */
#define CMD_ADDR_1ST_CYCLE(bank, ras)       (NFC_ADDR_VALUE((bank), ((ras) & 0xFFUL)))
#define CMD_ADDR_2ND_CYCLE(bank, ras)       (NFC_ADDR_VALUE((bank), (((ras) & 0xFF00UL) >> 8UL)))
#define CMD_ADDR_3RD_CYCLE(bank, ras)       (NFC_ADDR_VALUE((bank), (((ras) & 0xFF0000UL) >> 16UL)))

/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_IDXR_Bit_Position EXMC_NFC IDXR Bit Position
 * @{
 */
#define EXMC_NFC_IDXR_COL_POS               (0U)
#define EXMC_NFC_IDXR_2KPAGE_POS            (12U)
#define EXMC_NFC_IDXR_512MBIT_BANK_POS      (27U)
/**
 * @}
 */

/*!< NFC BACR register: page field value */
#define NFC_BACR_PAGE_VAL                   ((uint8_t)((READ_REG32_BIT(CM_NFC->BACR, NFC_BACR_PAGE) >> NFC_BACR_PAGE_POS) & 0x3UL))

/*!< NFC Page Size */
#define NFC_PAGE_SIZE                       (1024UL << NFC_BACR_PAGE_VAL)

/*!< NFC page max for the specified capacity */
#define NFC_PAGE_MAX(capacity_index)        ((1UL << (19U + (uint8_t)(capacity_index) - NFC_BACR_PAGE_VAL)) - 1UL)

/*!< NFC column max */
#define NFC_COLUMN_MAX                      ((1UL << (EXMC_NFC_IDXR_2KPAGE_POS + NFC_BACR_PAGE_VAL - 1U)) - 1UL)

/*!< NFC Spare Size for user data */
#define NFC_SPARE_SIZE_FOR_USER_DATA        ((READ_REG32_BIT(CM_NFC->BACR, NFC_BACR_SCS) >> NFC_BACR_SCS_POS) << 2UL)

/*!< NFC_ISTR register RBST bit mask */
#define NFC_FLAG_RB_BANKx_MASK(bank)        (EXMC_NFC_FLAG_RB_BANK0 << (EXMC_NFC_BANK7 & (bank)))

/*!< IDX register mask for 64bit */
#define NFC_NFC_ISTR_MASK                   (0xFF53UL)

/*!< NFC_DATR for 32bit */
#define NFC_DATR_REG32(x)                   (CM_NFC->DATR_BASE)

/**
 * @defgroup EXMC_NFC_ECC_Reference EXMC_NFC ECC Reference
 * @{
 */
/*!< NFC_SYND_REG for 32bit */
#define NFC_SYND_REG32(sect, reg)           (*((__IO uint32_t *)((uint32_t)(&(CM_NFC->ECC_SYND0_0)) + (((uint32_t)(sect)) << 4UL) + (((uint32_t)(reg)) << 2UL))))

/*!< NFC_ECCR_REG for 32bit */
#define NFC_ECCR_REG32(sect)                (*((__IO uint32_t *)((uint32_t)(&(CM_NFC->ECCR0))   + (((uint32_t)(sect)) << 2UL))))

/*!< NFC_SYND_MAX_Length (Unit: half-word ) */
#define NFC_SYND_MAX_LEN                    (8U)

/*!< NFC 1Bit ECC Error Bit Mask */
#define NFC_1BIT_ECC_ERR_BIT_MASK           (0x7U)

/*!< NFC 1Bit ECC Error Byte Position */
#define NFC_1BIT_ECC_ERR_BYTE_POS           (3U)
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_IDXR_Register_Reference EXMC_NFC IDXR Register Reference
 * @note capacity_index @ref EXMC_NFC_Memory_Capacity_Index
 * @{
 */
/*!< IDX register value for 64bit */
#define NFC_IDXR_VAL(bank, page, col, capacity_index)                          \
(   (((uint64_t)(col)) << EXMC_NFC_IDXR_COL_POS) |                             \
    (((uint64_t)(page)) << (EXMC_NFC_IDXR_2KPAGE_POS + NFC_BACR_PAGE_VAL - 1U)) | \
    (((uint64_t)(bank)) << (EXMC_NFC_IDXR_512MBIT_BANK_POS + (uint8_t)(capacity_index))))

/*!< IDX register mask for 64bit */
#define NFC_IDXR_MASK                       (0x1FFFFFFFFFULL)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup EXMC_NFC_Local_Functions EXMC_NFC Local Functions
 * @{
 */

/**
 * @brief  Get capacity size.
 * @param  None
 * @retval Capacity index @ref EXMC_NFC_Memory_Capacity_Index
 *           - NFC_CAPACITY_INDEX_512MBIT:  NFC device capacity 512MBit
 *           - NFC_CAPACITY_INDEX_1GBIT:    NFC device capacity 1GBit
 *           - NFC_CAPACITY_INDEX_2GBIT:    NFC device capacity 2GBit
 *           - NFC_CAPACITY_INDEX_4GBIT:    NFC device capacity 4GBit
 *           - NFC_CAPACITY_INDEX_8GBIT:    NFC device capacity 8GBit
 *           - NFC_CAPACITY_INDEX_16GBIT:   NFC device capacity 16GBit
 *           - NFC_CAPACITY_INDEX_32GBIT:   NFC device capacity 32GBit
 *           - NFC_CAPACITY_INDEX_64GBIT:   NFC device capacity 64GBit
 */
static uint32_t EXMC_NFC_GetCapacityIndex(void)
{
    uint32_t u32Index;
    const uint32_t u32BacrSize = READ_REG32_BIT(CM_NFC->BACR, NFC_BACR_SIZE);

    switch (u32BacrSize) {
        case EXMC_NFC_BANK_CAPACITY_512MBIT:
            u32Index = NFC_CAPACITY_INDEX_512MBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_1GBIT:
            u32Index = NFC_CAPACITY_INDEX_1GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_2GBIT:
            u32Index = NFC_CAPACITY_INDEX_2GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_4GBIT:
            u32Index = NFC_CAPACITY_INDEX_4GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_8GBIT:
            u32Index = NFC_CAPACITY_INDEX_8GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_16GBIT:
            u32Index = NFC_CAPACITY_INDEX_16GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_32GBIT:
            u32Index = NFC_CAPACITY_INDEX_32GBIT;
            break;
        default:
            u32Index = NFC_CAPACITY_INDEX_64GBIT;
            break;
    }

    return u32Index;
}

/**
 * @brief  Wait the specified flag with timeout.
 * @param  [in] u32Flag                 The specified flag
 *   @arg EXMC_NFC_FLAG_RB_BANK0:       NFC device bank 0 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK1:       NFC device bank 1 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK2:       NFC device bank 2 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK3:       NFC device bank 3 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK4:       NFC device bank 4 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK5:       NFC device bank 5 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK6:       NFC device bank 6 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK7:       NFC device bank 7 busy flag
 *   @arg EXMC_NFC_FLAG_ECC_ERR:        ECC error
 *   @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *   @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR: ECC correctable error
 *   @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR: ECC uncorrectable error
 * @param  enStatus                     The waiting flag status (SET or RESET).
 * @param  u32Timeout                   Timeout duration(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   Complete wait the expected status of the specified flags.
 *           - LL_ERR_TIMEOUT:          Wait timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
static int32_t EXMC_NFC_WaitFlagUntilTo(uint32_t u32Flag, en_flag_status_t enStatus, uint32_t u32Timeout)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32To = 0UL;

    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    while (EXMC_NFC_GetStatus(u32Flag) != enStatus) {
        /* Block checking flag if timeout value is EXMC_NFC_MAX_TIMEOUT */
        if ((u32To > u32Timeout) && (u32Timeout < EXMC_NFC_MAX_TIMEOUT)) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }

        u32To++;
    }

    return i32Ret;
}

/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Global_Functions EXMC_NFC Global Functions
 * @{
 */

/**
 * @brief  Set the fields of structure stc_exmc_nfc_init_t to default values
 * @param  [out] pstcNfcInit            Pointer to a @ref stc_exmc_nfc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcNfcInit value is NULL.
 */
int32_t EXMC_NFC_StructInit(stc_exmc_nfc_init_t *pstcNfcInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcNfcInit) {
        pstcNfcInit->stcBaseConfig.u32CapacitySize = EXMC_NFC_BANK_CAPACITY_8GBIT;
        pstcNfcInit->stcBaseConfig.u32MemoryWidth = EXMC_NFC_MEMORY_WIDTH_8BIT;
        pstcNfcInit->stcBaseConfig.u32BankNum = EXMC_NFC_4BANKS;
        pstcNfcInit->stcBaseConfig.u32PageSize = EXMC_NFC_PAGE_SIZE_2KBYTE;
        pstcNfcInit->stcBaseConfig.u32WriteProtect = EXMC_NFC_WR_PROTECT_ENABLE;
        pstcNfcInit->stcBaseConfig.u32EccMode = EXMC_NFC_1BIT_ECC;
        pstcNfcInit->stcBaseConfig.u32RowAddrCycle = EXMC_NFC_3_ROW_ADDR_CYCLE;
        pstcNfcInit->stcBaseConfig.u8SpareSizeForUserData = 0U;

        pstcNfcInit->stcTimingReg0.u32TS = 0x02UL;
        pstcNfcInit->stcTimingReg0.u32TWP = 0x02UL;
        pstcNfcInit->stcTimingReg0.u32TRP = 0x03UL;
        pstcNfcInit->stcTimingReg0.u32TH = 0x03UL;

        pstcNfcInit->stcTimingReg1.u32TWH = 0x03UL;
        pstcNfcInit->stcTimingReg1.u32TRH = 0x03UL;
        pstcNfcInit->stcTimingReg1.u32TRR = 0x02UL;
        pstcNfcInit->stcTimingReg1.u32TWB = 0x28UL;

        pstcNfcInit->stcTimingReg2.u32TCCS = 0x03UL;
        pstcNfcInit->stcTimingReg2.u32TWTR = 0x0DUL;
        pstcNfcInit->stcTimingReg2.u32TRTW = 0x05UL;
        pstcNfcInit->stcTimingReg2.u32TADL = 0x03UL;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Initialize EXMC_NFC function.
 * @param  [in] pstcNfcInit             Pointer to a @ref stc_exmc_nfc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcNfcInit value is NULL.
 */
int32_t EXMC_NFC_Init(const stc_exmc_nfc_init_t *pstcNfcInit)
{
    uint32_t u32RegVal;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcNfcInit) {
        DDL_ASSERT(IS_EXMC_NFC_BANK_CAPACITY(pstcNfcInit->stcBaseConfig.u32CapacitySize));
        DDL_ASSERT(IS_EXMC_NFC_MEMORY_WIDTH(pstcNfcInit->stcBaseConfig.u32MemoryWidth));
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(pstcNfcInit->stcBaseConfig.u32BankNum));
        DDL_ASSERT(IS_EXMC_NFC_PAGE_SIZE(pstcNfcInit->stcBaseConfig.u32PageSize));
        DDL_ASSERT(IS_EXMC_NFC_WR_PROTECT(pstcNfcInit->stcBaseConfig.u32WriteProtect));
        DDL_ASSERT(IS_EXMC_NFC_ECC_MD(pstcNfcInit->stcBaseConfig.u32EccMode));
        DDL_ASSERT(IS_EXMC_NFC_ROW_ADDR_CYCLES(pstcNfcInit->stcBaseConfig.u32RowAddrCycle));

