RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TS(pstcNfcInit->stcTimingReg0.u32TS));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWP(pstcNfcInit->stcTimingReg0.u32TWP));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRP(pstcNfcInit->stcTimingReg0.u32TRP));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TH(pstcNfcInit->stcTimingReg0.u32TH));

        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWH(pstcNfcInit->stcTimingReg1.u32TWH));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRH(pstcNfcInit->stcTimingReg1.u32TRH));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRR(pstcNfcInit->stcTimingReg1.u32TRR));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWB(pstcNfcInit->stcTimingReg1.u32TWB));

        DDL_ASSERT(IS_EXMC_NFC_TIMING_TCCS(pstcNfcInit->stcTimingReg2.u32TCCS));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWTR(pstcNfcInit->stcTimingReg2.u32TWTR));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRTW(pstcNfcInit->stcTimingReg2.u32TRTW));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TADL(pstcNfcInit->stcTimingReg2.u32TADL));

        /* Set NFC open-page.*/
        WRITE_REG32(CM_PERIC->NFC_STCR, pstcNfcInit->u32OpenPage);

        /* Disable hardware ECC.*/
        WRITE_REG32(CM_NFC->IENR, 0x00000080UL);

        /* Clear flag.*/
        WRITE_REG32(CM_NFC->ISTR, 0x00000000UL);

        /* Set NFC base configure.*/
        u32RegVal = (pstcNfcInit->stcBaseConfig.u32CapacitySize | pstcNfcInit->stcBaseConfig.u32MemoryWidth | \
                     pstcNfcInit->stcBaseConfig.u32BankNum      | pstcNfcInit->stcBaseConfig.u32PageSize | \
                     pstcNfcInit->stcBaseConfig.u32WriteProtect | pstcNfcInit->stcBaseConfig.u32EccMode | \
                     pstcNfcInit->stcBaseConfig.u32RowAddrCycle | \
                     (((uint32_t)pstcNfcInit->stcBaseConfig.u8SpareSizeForUserData) << NFC_BACR_SCS_POS));
        WRITE_REG32(CM_NFC->BACR, u32RegVal);

        /* Set NFC timing register 0.*/
        u32RegVal = ((pstcNfcInit->stcTimingReg0.u32TS << NFC_TMCR0_TS_POS)   | \
                     (pstcNfcInit->stcTimingReg0.u32TWP << NFC_TMCR0_TWP_POS) | \
                     (pstcNfcInit->stcTimingReg0.u32TRP << NFC_TMCR0_TRP_POS) | \
                     (pstcNfcInit->stcTimingReg0.u32TH << NFC_TMCR0_TH_POS));
        WRITE_REG32(CM_NFC->TMCR0, u32RegVal);

        /* Set NFC timing register 1.*/
        u32RegVal = ((pstcNfcInit->stcTimingReg1.u32TWH << NFC_TMCR1_TWH_POS) | \
                     (pstcNfcInit->stcTimingReg1.u32TRH << NFC_TMCR1_TRH_POS) | \
                     (pstcNfcInit->stcTimingReg1.u32TRR << NFC_TMCR1_TRR_POS) | \
                     (pstcNfcInit->stcTimingReg1.u32TWB << NFC_TMCR1_TWB_POS));
        WRITE_REG32(CM_NFC->TMCR1, u32RegVal);

        /* Set NFC timing register 2.*/
        u32RegVal = ((pstcNfcInit->stcTimingReg2.u32TCCS << NFC_TMCR2_TCCS_POS) | \
                     (pstcNfcInit->stcTimingReg2.u32TWTR << NFC_TMCR2_TWTR_POS) | \
                     (pstcNfcInit->stcTimingReg2.u32TRTW << NFC_TMCR2_TRTW_POS) | \
                     (pstcNfcInit->stcTimingReg2.u32TADL << NFC_TMCR2_TADL_POS));
        WRITE_REG32(CM_NFC->TMCR2, u32RegVal);

        /* De-select NFC bank */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_DESELECT_CHIP);
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  De-Initialize EXMC_NFC function.
 * @param  None
 * @retval None
 */
void EXMC_NFC_DeInit(void)
{
    WRITE_REG32(CM_NFC->BACR, 0x00002187UL);
    WRITE_REG32(CM_NFC->IENR, 0x00000080UL);
    WRITE_REG32(CM_NFC->ISTR, 0x00000000UL);
    WRITE_REG32(CM_NFC->TMCR0, 0x03030202UL);
    WRITE_REG32(CM_NFC->TMCR1, 0x28080303UL);
    WRITE_REG32(CM_NFC->TMCR2, 0x03050D03UL);
}

/**
 * @brief  Enable/disable NFC.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void EXMC_NFC_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG32_BIT(CM_PERIC->NFC_ENAR, PERIC_NFC_ENAR_NFCEN);
    } else {
        CLR_REG32_BIT(CM_PERIC->NFC_ENAR, PERIC_NFC_ENAR_NFCEN);
    }
}

/**
 * @brief  Enable/disable NFC ECC function.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void EXMC_NFC_EccCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        CLR_REG32_BIT(CM_NFC->IENR, NFC_IENR_ECCDIS);
    } else {
        SET_REG32_BIT(CM_NFC->IENR, NFC_IENR_ECCDIS);
    }
}

/**
 * @brief  Enable/disable NFC write protection function.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void EXMC_NFC_WriteProtectCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        CLR_REG32_BIT(CM_NFC->BACR, NFC_BACR_WP);
    } else {
        SET_REG32_BIT(CM_NFC->BACR, NFC_BACR_WP);
    }
}

/**
 * @brief  Enable or disable the specified NFC interrupt
 * @param  [in] u16IntType                The specified interrupt
 *         This parameter can be any composed value of the macros group @ref EXMC_NFC_Interrupt
 *           @arg EXMC_NFC_INT_RB_BANK0:  NFC bank 0 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK1:  NFC bank 1 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK2:  NFC bank 2 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK3:  NFC bank 3 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK4:  NFC bank 4 device ready flag
 *           @arg EXMC_NFC_INT_RB_BANK5:  NFC bank 5 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK6:  NFC bank 6 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK7:  NFC bank 7 device ready interrupt
 *           @arg EXMC_NFC_INT_ECC_ERROR: ECC error interrupt
 *           @arg EXMC_NFC_INT_ECC_CALC_COMPLETION: Calculating ECC completely interrupt
 *           @arg EXMC_NFC_INT_ECC_CORRECTABLE_ERR: ECC correctable error interrupt
 *           @arg EXMC_NFC_INT_ECC_UNCORRECTABLE_ERR: ECC uncorrectable error interrupt
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void EXMC_NFC_IntCmd(uint16_t u16IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_EXMC_NFC_INT(u16IntType));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(CM_NFC->IENR, u16IntType);
    } else {
        CLR_REG16_BIT(CM_NFC->IENR, u16IntType);
    }
}

/**
 * @brief  Get the specified flag status.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the macros group @ref EXMC_NFC_Flag
 *           @arg EXMC_NFC_FLAG_RB_BANK0:  NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1:  NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2:  NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3:  NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4:  NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5:  NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6:  NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7:  NFC bank 7 device ready flag
 *           @arg EXMC_NFC_FLAG_ECC_ERR:   ECC error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculate ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR: ECC uncorrectable error
 *           @arg EXMC_NFC_FLAG_ECC_CALCULATING: Calculating ECC
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t EXMC_NFC_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enStatus1 = RESET;
    en_flag_status_t enStatus2 = RESET;

    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    if (0UL != (u32Flag & NFC_NFC_ISTR_MASK)) {
        if (0UL != READ_REG32_BIT(CM_NFC->ISTR, (u32Flag & NFC_NFC_ISTR_MASK))) {
            enStatus1 = SET;
        }
    }

    if (0UL != (u32Flag & EXMC_NFC_FLAG_ECC_CALCULATING)) {
        if (0UL != READ_REG32_BIT(CM_PERIC->NFC_STSR, PERIC_NFC_STSR_PECC)) {
            enStatus2 = SET;
        }
    }

    return (((SET == enStatus1) || (SET == enStatus2)) ? SET : RESET);
}

/**
 * @brief  Clear the specified flag.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_FLAG_RB_BANK0:  NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1:  NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2:  NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3:  NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4:  NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5:  NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6:  NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7:  NFC bank 7 device ready flag
 *           @arg EXMC_NFC_FLAG_ECC_ERR:   ECC error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR: ECC uncorrectable error
 * @retval None
 */
void EXMC_NFC_ClearStatus(uint32_t u32Flag)
{
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    CLR_REG32_BIT(CM_NFC->ISTR, u32Flag);
}

/**
 * @brief  Get the interrupt result status.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_FLAG_RB_BANK0:  NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1:  NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2:  NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3:  NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4:  NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5:  NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6:  NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7:  NFC bank 7 device ready flag
 *           @arg EXMC_NFC_FLAG_ECC_ERR:   ECC error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR: ECC uncorrectable error
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t EXMC_NFC_GetIntResultStatus(uint32_t u32Flag)
{
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

