RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
    return ((READ_REG32_BIT(CM_NFC->IRSR, u32Flag) > 0UL) ? SET : RESET);
}

/**
 * @brief  Get the 1BIT ECC result of the specified section.
 * @param  [in] u32Section              The specified section
 *         This parameter can be one of the macros group @ref EXMC_NFC_ECC_Section
 *           @arg EXMC_NFC_ECC_SECTION0:  ECC section 0
 *           @arg EXMC_NFC_ECC_SECTION1:  ECC section 1
 *           @arg EXMC_NFC_ECC_SECTION2:  ECC section 2
 *           @arg EXMC_NFC_ECC_SECTION3:  ECC section 3
 *           @arg EXMC_NFC_ECC_SECTION4:  ECC section 4
 *           @arg EXMC_NFC_ECC_SECTION5:  ECC section 5
 *           @arg EXMC_NFC_ECC_SECTION6:  ECC section 6
 *           @arg EXMC_NFC_ECC_SECTION7:  ECC section 7
 *           @arg EXMC_NFC_ECC_SECTION8:  ECC section 8
 *           @arg EXMC_NFC_ECC_SECTION9:  ECC section 9
 *           @arg EXMC_NFC_ECC_SECTION10: ECC section 10
 *           @arg EXMC_NFC_ECC_SECTION11: ECC section 11
 *           @arg EXMC_NFC_ECC_SECTION12: ECC section 12
 *           @arg EXMC_NFC_ECC_SECTION13: ECC section 13
 *           @arg EXMC_NFC_ECC_SECTION14: ECC section 14
 *           @arg EXMC_NFC_ECC_SECTION15: ECC section 15
 * @retval Return one of the macros group @ref EXMC_NFC_1Bit_ECC_Result
 *           - EXMC_NFC_1BIT_ECC_NONE_ERR:          None error
 *           - EXMC_NFC_1BIT_ECC_SINGLE_BIT_ERR:    Single bit error
 *           - EXMC_NFC_1BIT_ECC_MULTIPLE_BITS_ERR: Multiple bit error
 */
uint32_t EXMC_NFC_Get1BitEccResult(uint32_t u32Section)
{
    DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

    return READ_REG32_BIT(NFC_ECCR_REG32(u32Section), (NFC_ECCR_SE | NFC_ECCR_ME));
}

/**
 * @brief  Get the 1BIT ECC error bit of the specified section.
 * @param  [in] u32Section              The specified section
 *         This parameter can be one of the macros group @ref EXMC_NFC_ECC_Section
 *           @arg EXMC_NFC_ECC_SECTION0:  ECC section 0
 *           @arg EXMC_NFC_ECC_SECTION1:  ECC section 1
 *           @arg EXMC_NFC_ECC_SECTION2:  ECC section 2
 *           @arg EXMC_NFC_ECC_SECTION3:  ECC section 3
 *           @arg EXMC_NFC_ECC_SECTION4:  ECC section 4
 *           @arg EXMC_NFC_ECC_SECTION5:  ECC section 5
 *           @arg EXMC_NFC_ECC_SECTION6:  ECC section 6
 *           @arg EXMC_NFC_ECC_SECTION7:  ECC section 7
 *           @arg EXMC_NFC_ECC_SECTION8:  ECC section 8
 *           @arg EXMC_NFC_ECC_SECTION9:  ECC section 9
 *           @arg EXMC_NFC_ECC_SECTION10: ECC section 10
 *           @arg EXMC_NFC_ECC_SECTION11: ECC section 11
 *           @arg EXMC_NFC_ECC_SECTION12: ECC section 12
 *           @arg EXMC_NFC_ECC_SECTION13: ECC section 13
 *           @arg EXMC_NFC_ECC_SECTION14: ECC section 14
 *           @arg EXMC_NFC_ECC_SECTION15: ECC section 15
 * @retval Return one of the macros group @ref EXMC_NFC_1Bit_ECC_Error_Bit_Location
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT0: Bit0 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT1: Bit1 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT2: Bit2 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT3: Bit3 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT4: Bit4 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT5: Bit5 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT6: Bit6 error
 *           - EXMC_NFC_1BIT_ECC_ERR_BIT7: Bit7 error
 */
uint32_t EXMC_NFC_Get1BitEccErrBitLocation(uint32_t u32Section)
{
    DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

    return READ_REG32_BIT(NFC_ECCR_REG32(u32Section), NFC_1BIT_ECC_ERR_BIT_MASK);
}

/**
 * @brief  Get the 1BIT ECC error byte of the specified section.
 * @param  [in] u32Section              The specified section
 *         This parameter can be one of the macros group @ref EXMC_NFC_ECC_Section
 *           @arg EXMC_NFC_ECC_SECTION0:  ECC section 0
 *           @arg EXMC_NFC_ECC_SECTION1:  ECC section 1
 *           @arg EXMC_NFC_ECC_SECTION2:  ECC section 2
 *           @arg EXMC_NFC_ECC_SECTION3:  ECC section 3
 *           @arg EXMC_NFC_ECC_SECTION4:  ECC section 4
 *           @arg EXMC_NFC_ECC_SECTION5:  ECC section 5
 *           @arg EXMC_NFC_ECC_SECTION6:  ECC section 6
 *           @arg EXMC_NFC_ECC_SECTION7:  ECC section 7
 *           @arg EXMC_NFC_ECC_SECTION8:  ECC section 8
 *           @arg EXMC_NFC_ECC_SECTION9:  ECC section 9
 *           @arg EXMC_NFC_ECC_SECTION10: ECC section 10
 *           @arg EXMC_NFC_ECC_SECTION11: ECC section 11
 *           @arg EXMC_NFC_ECC_SECTION12: ECC section 12
 *           @arg EXMC_NFC_ECC_SECTION13: ECC section 13
 *           @arg EXMC_NFC_ECC_SECTION14: ECC section 14
 *           @arg EXMC_NFC_ECC_SECTION15: ECC section 15
 * @retval Return the 1BIT ECC error byte.
 */
uint32_t EXMC_NFC_Get1BitEccErrByteLocation(uint32_t u32Section)
{
    DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

    return (READ_REG32_BIT(NFC_ECCR_REG32(u32Section), NFC_ECCR_ERRLOC) >> NFC_1BIT_ECC_ERR_BYTE_POS);
}

/**
 * @brief  Set NFC spare area size.
 * @param  [in] u8SpareSizeForUserData  NFC spare area size for user data
 * @retval None
 */
void EXMC_NFC_SetSpareAreaSize(uint8_t u8SpareSizeForUserData)
{
    MODIFY_REG32(CM_NFC->BACR, NFC_BACR_SCS, ((((uint32_t)u8SpareSizeForUserData) << NFC_BACR_SCS_POS) & NFC_BACR_SCS));
}

/**
 * @brief  Set NFC ECC mode.
 * @param  [in] u32EccMode              ECC mode
 *         This parameter can be one of the macros group @ref EXMC_NFC_ECC_Mode
 *           @arg EXMC_NFC_1BIT_ECC:    1 bit ECC
 *           @arg EXMC_NFC_4BIT_ECC:    4 bit ECC
 * @retval None
 */
void EXMC_NFC_SetEccMode(uint32_t u32EccMode)
{
    DDL_ASSERT(IS_EXMC_NFC_ECC_MD(u32EccMode));

    MODIFY_REG32(CM_NFC->BACR, NFC_BACR_ECCM, u32EccMode);
}

/**
 * @brief  Get the 4 bits ECC syndrome register value.
 * @param  [in] u32Section              The syndrome section
 *         This parameter can be one of the macros group @ref EXMC_NFC_ECC_Section
 *           @arg EXMC_NFC_ECC_SECTION0:  ECC section 0
 *           @arg EXMC_NFC_ECC_SECTION1:  ECC section 1
 *           @arg EXMC_NFC_ECC_SECTION2:  ECC section 2
 *           @arg EXMC_NFC_ECC_SECTION3:  ECC section 3
 *           @arg EXMC_NFC_ECC_SECTION4:  ECC section 4
 *           @arg EXMC_NFC_ECC_SECTION5:  ECC section 5
 *           @arg EXMC_NFC_ECC_SECTION6:  ECC section 6
 *           @arg EXMC_NFC_ECC_SECTION7:  ECC section 7
 *           @arg EXMC_NFC_ECC_SECTION8:  ECC section 8
 *           @arg EXMC_NFC_ECC_SECTION9:  ECC section 9
 *           @arg EXMC_NFC_ECC_SECTION10: ECC section 10
 *           @arg EXMC_NFC_ECC_SECTION11: ECC section 11
 *           @arg EXMC_NFC_ECC_SECTION12: ECC section 12
 *           @arg EXMC_NFC_ECC_SECTION13: ECC section 13
 *           @arg EXMC_NFC_ECC_SECTION14: ECC section 14
 *           @arg EXMC_NFC_ECC_SECTION15: ECC section 15
 * @param  [out] au16Synd               The syndrome value
 * @param  [in] u8Len                   The length to be read(unit: half-word)
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer au16Synd value is NULL or u8Len is out of range.
 * @note  u8Len value don't be greater than 8
 */
int32_t EXMC_NFC_GetSyndrome(uint32_t u32Section, uint16_t au16Synd[], uint8_t u8Len)
{
    uint8_t i;
    uint32_t u32SyndVal;
    uint8_t u8LoopWords;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != au16Synd) && (u8Len <= NFC_SYND_MAX_LEN)) {
        DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

        u8LoopWords = (u8Len >> 1U);
        for (i = 0U; i < u8LoopWords; i++) {
            u32SyndVal = READ_REG32(NFC_SYND_REG32(u32Section, i));
            RW_MEM16(&au16Synd[i * 2U]) = (uint16_t)(u32SyndVal);
            RW_MEM16(&au16Synd[i * 2U + 1U ]) = (uint16_t)(u32SyndVal >> 16U);
        }

