RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
        if ((u8Len % 2U) != 0U) {
            u32SyndVal = READ_REG32(NFC_SYND_REG32(u32Section, i));
            RW_MEM16(&au16Synd[i * 2U]) = (uint16_t)(u32SyndVal);
        }
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Read NFC device status
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @retval NFC device status
 */
uint32_t EXMC_NFC_ReadStatus(uint32_t u32Bank)
{
    uint32_t u32Status;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

    /* Write 0x81000M70 to NFC_CMDR, M = bank number */
    WRITE_REG32(CM_NFC->CMDR, CMD_READ_STATUS(u32Bank));

    u32Status = READ_REG32(CM_NFC->DATR_BASE);

    EXMC_NFC_DeselectChip();

    return u32Status;
}

/**
 * @brief  Read status enhanced
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32RowAddr              The row address
 * @retval NFC device status enhanced
 */
uint32_t EXMC_NFC_ReadStatusEnhanced(uint32_t u32Bank, uint32_t u32RowAddr)
{
    uint32_t u32Status;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

    /* Erase block step:
        1. Write 0x81000M78 to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Read Data Register */
    WRITE_REG32(CM_NFC->CMDR, CMD_READ_STATUS_ENHANCED(u32Bank));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddr));

    u32Status = READ_REG32(CM_NFC->DATR_BASE);

    EXMC_NFC_DeselectChip();

    return u32Status;
}

/**
 * @brief  Reset NFC device
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_Reset(uint32_t u32Bank, uint32_t u32Timeout)
{
    int32_t i32Ret;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset step:
        1. Write 0x00000MFF to NFC_CMDR, M = bank number
        2. Wait RB signal until high level */
    WRITE_REG32(CM_NFC->CMDR, CMD_RESET(u32Bank));

    i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);

    EXMC_NFC_DeselectChip();

    return i32Ret;
}

/**
 * @brief  Asynchronous reset
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_AsyncReset(uint32_t u32Bank, uint32_t u32Timeout)
{
    int32_t i32Ret;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset step:
        1. Write 0x00000MFC to NFC_CMDR, M = bank number
        2. Wait RB signal until high level */
    WRITE_REG32(CM_NFC->CMDR, CMD_ASYNC_RESET(u32Bank));

    i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
    EXMC_NFC_DeselectChip();
    return i32Ret;
}

/**
 * @brief  Reset lun of NFC device
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32RowAddr              The row address
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_ResetLun(uint32_t u32Bank, uint32_t u32RowAddr, uint32_t u32Timeout)
{
    int32_t i32Ret;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

