RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset lun step:
        1. Write 0x82000MFA to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Wait RB signal until high level */
    WRITE_REG32(CM_NFC->CMDR, CMD_RESET_LUN(u32Bank));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddr));

    i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
    return i32Ret;
}

/**
 * @brief  Read ID
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32IdAddr               The address
 * @param  [in] au8DevId                The id buffer
 * @param  [in] u32NumBytes             The number of bytes to read
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Read timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au8DevId value is NULL or u32NumBytes value is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_ReadId(uint32_t u32Bank, uint32_t u32IdAddr,
                        uint8_t au8DevId[], uint32_t u32NumBytes, uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Value;
    const uint32_t u32LoopWords = u32NumBytes / 4UL;
    const uint32_t u32RemainBytes = u32NumBytes % 4UL;
    uint32_t u32TmpId;
    uint32_t u32CapacityIndex;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != au8DevId) && (u32NumBytes > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(u32IdAddr <= 0xFFUL);

        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank)   | EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR | \
                             EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR | EXMC_NFC_FLAG_ECC_CALC_COMPLETION | \
                             EXMC_NFC_FLAG_ECC_ERR);

        /* 1. Write 0x00000000 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_RD_1ST);

        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        u32CapacityIndex = EXMC_NFC_GetCapacityIndex();
        u64Value = (NFC_IDXR_VAL(u32Bank, 0UL, 0UL, u32CapacityIndex) & NFC_IDXR_MASK);
        WRITE_REG32(CM_NFC->IDXR0, (uint32_t)(u64Value & 0xFFFFFFFFUL));
        WRITE_REG32(CM_NFC->IDXR1, (uint32_t)(u64Value >> 32U));

        /* 3. Write 0x000000E0 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_RD_2ND);

        /* 4. Wait RB signal until high level */
        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
        if (LL_OK == i32Ret) {
            /* Read Id step:
                1. Write 0x81000M90 to NFC_CMDR, M = bank number
                2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB=ID address
                3. Read NFC_DATR
                4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
            WRITE_REG32(CM_NFC->CMDR, CMD_READ_ID(u32Bank));
            WRITE_REG32(CM_NFC->CMDR, CMD_READ_ID_ADDR(u32Bank, u32IdAddr));
            for (i = 0UL; i < u32LoopWords; i++) {
                u32TmpId = NFC_DATR_REG32(i);
                (void)memcpy(&au8DevId[i * 4UL], &u32TmpId, 4UL);
            }

            if (u32RemainBytes > 0UL) {
                u32TmpId = NFC_DATR_REG32(i);
                (void)memcpy(&au8DevId[i * 4UL], &u32TmpId, u32RemainBytes);
            }

            i32Ret = LL_OK;
        }

        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  Read Unique ID
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] au32UniqueId            The id buffer
 * @param  [in] u8NumWords              The number of words to read
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Read timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32UniqueId value is NULL or u8NumWords value is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
int32_t EXMC_NFC_ReadUniqueId(uint32_t u32Bank, uint32_t au32UniqueId[], uint8_t u8NumWords, uint32_t u32Timeout)
{
    uint8_t i;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != au32UniqueId) && (u8NumWords > 0U)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

