RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        /* Read Id step:
            1. Write 0x81000M90 to NFC_CMDR, M = bank number
            2. Write 0x40000M00 to NFC_CMDR, M = bank number, AB=ID address
            3. Read NFC_DATR
            4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        WRITE_REG32(CM_NFC->CMDR, CMD_READ_UNIQUEID(u32Bank));
        WRITE_REG32(CM_NFC->CMDR, CMD_READ_UNIQUEID_ADDR(u32Bank));

        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
        if (LL_OK == i32Ret) {
            for (i = 0U; i < u8NumWords; i++) {
                au32UniqueId[i] = NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  Read parameter page
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] au32Data                The data buffer
 * @param  [in] u16NumWords             The number of words to read
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Read timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32Data value is NULL or u16NumWords value is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_ReadParameterPage(uint32_t u32Bank,
                                   uint32_t au32Data[], uint16_t u16NumWords, uint32_t u32Timeout)
{
    uint16_t i;
    int32_t i32Ret = LL_ERR;

    if ((NULL != au32Data) && (u16NumWords > 0U)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        /* Read parameter page step:
            1. Write 0x81000MEC to NFC_CMDR, M = bank number
            2. Write 0x40000M00 to NFC_CMDR, M = bank number
            3. Read NFC_DATR
            4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        WRITE_REG32(CM_NFC->CMDR, CMD_READ_PARAMETER_PAGE(u32Bank));
        WRITE_REG32(CM_NFC->CMDR, CMD_READ_PARAMETER_PAGE_ADDR(u32Bank));

        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
        if (LL_OK == i32Ret) {
            for (i = 0U; i < u16NumWords; i++) {
                au32Data[i] =  NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  Set feature
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u8FeatureAddr           The feature address
 * @param  [in] au32Data                The data buffer
 * @param  [in] u8NumWords              The number of words to set
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Set timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32Data value is NULL or u8NumWords value is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_SetFeature(uint32_t u32Bank, uint8_t u8FeatureAddr,
                            const uint32_t au32Data[], uint8_t u8NumWords, uint32_t u32Timeout)
{
    uint8_t i;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != au32Data) && (u8NumWords > 0U)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        WRITE_REG32(CM_NFC->CMDR, CMD_SET_FEATURE(u32Bank));
        WRITE_REG32(CM_NFC->CMDR, CMD_SET_FEATURE_ADDR(u32Bank, u8FeatureAddr));

        for (i = 0U; i < u8NumWords; i++) {
            NFC_DATR_REG32(i) = au32Data[i];
        }

        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);

        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  Get feature
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u8FeatureAddr           The feature address
 * @param  [out] au32Data               The data buffer
 * @param  [in] u8NumWords              The number of words to get
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Get timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32Data value is NULL or u8NumWords value is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_GetFeature(uint32_t u32Bank, uint8_t u8FeatureAddr,
                            uint32_t au32Data[], uint8_t u8NumWords, uint32_t u32Timeout)
{
    uint8_t i;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != au32Data) && (u8NumWords > 0U)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

