RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        WRITE_REG32(CM_NFC->CMDR, CMD_GET_FEATURE(u32Bank));
        WRITE_REG32(CM_NFC->CMDR, CMD_GET_FEATURE_ADDR(u32Bank, u8FeatureAddr));

        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
        if (LL_OK == i32Ret) {
            for (i = 0U; i < u8NumWords; i++) {
                au32Data[i] = NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  Erase NFC device block
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32RowAddr              The row address
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Erase timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_EraseBlock(uint32_t u32Bank, uint32_t u32RowAddr, uint32_t u32Timeout)
{
    int32_t i32Ret;

    DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));

    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Erase block step:
        1. Write 0x81000M60 to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Write 0x00000MD0 to NFC_CMDR, M = bank number
        6. Wait RB signal until high level */
    WRITE_REG32(CM_NFC->CMDR, CMD_ERASE_BLOCK_1ST_CYCLE(u32Bank));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddr));
    WRITE_REG32(CM_NFC->CMDR, CMD_ERASE_BLOCK_2ND_CYCLE(u32Bank));

    i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
    return i32Ret;
}

/**
 * @brief  NFC read operation
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] u32Col                  The column address
 * @param  [out] au32Data               The buffer for reading
 * @param  [in] u32NumWords             The buffer size for words
 * @param  [in] enEccState              Disable/enable ECC function
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32Data value is NULL or u32NumWords is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_Read(uint32_t u32Bank, uint32_t u32Page, uint32_t u32Col,
                      uint32_t au32Data[], uint32_t u32NumWords,
                      en_functional_state_t enEccState, uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Value;
    int32_t i32Ret = LL_ERR_INVD_PARAM;
    const uint32_t u32CapacityIndex = EXMC_NFC_GetCapacityIndex();

    if ((NULL != au32Data) && (u32NumWords > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_EXMC_NFC_PAGE(u32Page, u32CapacityIndex));
        DDL_ASSERT(IS_EXMC_NFC_COLUMN(u32Col));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enEccState));

        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank) | EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR | \
                             EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR | EXMC_NFC_FLAG_ECC_CALC_COMPLETION | EXMC_NFC_FLAG_ECC_ERR);

        EXMC_NFC_EccCmd(enEccState);

        /* Read page step:
            1. Write 0x00000000 to NFC_CMDR
            2. Write NAND Flash address to NFC_IDXR0/1
            3. Write 0x000000E0 to NFC_CMDR
            4. Wait RB signal until high level
            5. Read NFC_DATR
            6. Write 0x000000FE to NFC_CMDR, and invalidate CE */

        /* 1. Write 0x00000000 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_RD_1ST);

        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        u64Value = (NFC_IDXR_VAL(u32Bank, u32Page, u32Col, u32CapacityIndex) & NFC_IDXR_MASK);
        WRITE_REG32(CM_NFC->IDXR0, (uint32_t)(u64Value & 0xFFFFFFFFUL));
        WRITE_REG32(CM_NFC->IDXR1, (uint32_t)(u64Value >> 32UL));

        /* 3. Write 0x000000E0 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_RD_2ND);

        /* 4. Wait RB signal until high level */
        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);
        if (LL_OK == i32Ret) {
            /* 5. Read NFC_DATR */
            for (i = 0UL; i < u32NumWords; i++) {
                au32Data[i] = NFC_DATR_REG32(i);
            }

            /* Clear Flag */
            EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

            if (ENABLE == enEccState) {
                /* Write 0x00000023 to NFC_CMDR */
                WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_CALCULATE_ECC);

                /* 4. Wait RB signal until high level */
                i32Ret = EXMC_NFC_WaitFlagUntilTo(EXMC_NFC_FLAG_ECC_CALCULATING, RESET, u32Timeout);
                EXMC_NFC_EccCmd(DISABLE);
            }
        }

