RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_nfc.c
        /* 6. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        EXMC_NFC_DeselectChip();
    }

    return i32Ret;
}

/**
 * @brief  NFC write operation
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] u32Col                  The column address
 * @param  [in] au32Data                The buffer for writing
 * @param  [in] u32NumWords             The buffer size for words
 * @param  [in] enEccState              Disable/enable ECC function
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer au32Data value is NULL or u32NumWords is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT.
 */
int32_t EXMC_NFC_Write(uint32_t u32Bank, uint32_t u32Page, uint32_t u32Col,
                       const uint32_t au32Data[], uint32_t u32NumWords,
                       en_functional_state_t enEccState, uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Value;
    int32_t i32Ret = LL_ERR_INVD_PARAM;
    const uint32_t u32CapacityIndex = EXMC_NFC_GetCapacityIndex();

    if ((NULL != au32Data) && (u32NumWords > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_EXMC_NFC_PAGE(u32Page, u32CapacityIndex));
        DDL_ASSERT(IS_EXMC_NFC_COLUMN(u32Col));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enEccState));

        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank) | EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERR | \
                             EXMC_NFC_FLAG_ECC_CORRECTABLE_ERR | EXMC_NFC_FLAG_ECC_CALC_COMPLETION | EXMC_NFC_FLAG_ECC_ERR);

        EXMC_NFC_EccCmd(enEccState);

        /* Write page step:
            1. Write 0x00000080 to NFC_CMDR
            2. Write NAND Flash address to NFC_IDXR0/1
            3. Write NFC_DATR
            4. Write 0x00000010 to NFC_CMDR
            5. Wait RB signal until high level
            6. Write 0x000000FE to NFC_CMDR, and invalidate CE */

        /* 1. Write 0x00000080 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_PAGE_PROGRAM_1ST);

        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        u64Value = (NFC_IDXR_VAL(u32Bank, u32Page, u32Col, u32CapacityIndex) & NFC_IDXR_MASK);
        WRITE_REG32(CM_NFC->IDXR0, (uint32_t)(u64Value & 0xFFFFFFFFUL));
        WRITE_REG32(CM_NFC->IDXR1, (uint32_t)(u64Value >> 32UL));

        /* 3. Write NFC_DATR */
        for (i = 0UL; i < u32NumWords; i++) {
            NFC_DATR_REG32(i) = au32Data[i];
        }

        /* 4. Write 0x00000010 to NFC_CMDR */
        WRITE_REG32(CM_NFC->CMDR, EXMC_NFC_CMD_PAGE_PROGRAM_2ND);

        /* 5. Wait RB signal until high level */
        i32Ret = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), SET, u32Timeout);

        /* Write 0x000000FE to NFC_CMDR, and invalidate CE */
        EXMC_NFC_DeselectChip();

        if (ENABLE == enEccState) {
            EXMC_NFC_EccCmd(DISABLE);
        }
    }

    return i32Ret;
}

/**
 * @brief  NFC page read
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [out] pu8Data                The buffer for reading
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer pu8Data value value is NULL or u32NumBytes is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
int32_t EXMC_NFC_ReadPageMeta(uint32_t u32Bank, uint32_t u32Page, uint8_t *pu8Data,
                              uint32_t u32NumBytes, uint32_t u32Timeout)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDR_ALIGN_WORD(pu8Data));

        i32Ret = EXMC_NFC_Read(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                               (u32NumBytes / 4UL), DISABLE, u32Timeout);
    }

    return i32Ret;
}

/**
 * @brief  NFC page write
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] pu8Data                 The buffer for writing
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer pu8Data value is NULL or u32NumBytes is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
int32_t EXMC_NFC_WritePageMeta(uint32_t u32Bank, uint32_t u32Page,
                               const uint8_t *pu8Data, uint32_t u32NumBytes, uint32_t u32Timeout)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDR_ALIGN_WORD(pu8Data));

        i32Ret = EXMC_NFC_Write(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                                (u32NumBytes / 4UL), DISABLE, u32Timeout);
    }

    return i32Ret;
}

/**
 * @brief  NFC page read by hardware ECC
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [out] pu8Data                The buffer for reading
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer pu8Data value is NULL or u32NumBytes is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
int32_t EXMC_NFC_ReadPageHwEcc(uint32_t u32Bank, uint32_t u32Page,
                               uint8_t *pu8Data, uint32_t u32NumBytes, uint32_t u32Timeout)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;
#ifdef __DEBUG
    const uint32_t u32PageSize = NFC_PAGE_SIZE;
    const uint32_t u32SpareSizeUserData = NFC_SPARE_SIZE_FOR_USER_DATA;
#endif

    if ((NULL != pu8Data) && (u32NumBytes > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDR_ALIGN_WORD(pu8Data));
        DDL_ASSERT(u32NumBytes <= (u32PageSize + u32SpareSizeUserData));

        i32Ret = EXMC_NFC_Read(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                               (u32NumBytes / 4UL), ENABLE, u32Timeout);
    }

    return i32Ret;
}

/**
 * @brief  NFC page  write by hardware ECC
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the macros group @ref EXMC_NFC_Bank
 *           @arg EXMC_NFC_BANK0:       NFC device bank 0
 *           @arg EXMC_NFC_BANK1:       NFC device bank 1
 *           @arg EXMC_NFC_BANK2:       NFC device bank 2
 *           @arg EXMC_NFC_BANK3:       NFC device bank 3
 *           @arg EXMC_NFC_BANK4:       NFC device bank 4
 *           @arg EXMC_NFC_BANK5:       NFC device bank 5
 *           @arg EXMC_NFC_BANK6:       NFC device bank 6
 *           @arg EXMC_NFC_BANK7:       NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] pu8Data                 The buffer for writing
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value(Max value @ref EXMC_NFC_Max_Timeout)
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_TIMEOUT:          Write timeout.
 *           - LL_ERR_INVD_PARAM:       The pointer pu8Data value is NULL or u32NumBytes is 0.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
int32_t EXMC_NFC_WritePageHwEcc(uint32_t u32Bank, uint32_t u32Page,
                                const uint8_t *pu8Data, uint32_t u32NumBytes, uint32_t u32Timeout)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;
#ifdef __DEBUG
    const uint32_t u32PageSize = NFC_PAGE_SIZE;
    const uint32_t u32SpareSizeUserData = NFC_SPARE_SIZE_FOR_USER_DATA;
#endif

    if ((NULL != pu8Data) && (u32NumBytes > 0UL)) {
        DDL_ASSERT(IS_EXMC_NFC_BANK(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDR_ALIGN_WORD((uint32_t)pu8Data));
        DDL_ASSERT(u32NumBytes <= (u32PageSize + u32SpareSizeUserData));

        i32Ret = EXMC_NFC_Write(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                                (u32NumBytes / 4UL), ENABLE, u32Timeout);
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_NFC_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
